<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\backend\ArticleandNews;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $all_news = array(
            array('id' => 1, 'title' =>'হার্ট অ্যাটাক এর লক্ষণ, কারণ ও ঝুঁকি কমানোর উপায়', 'url' => 'https://www.primehospitalltd.com/blog/8', 'description' => 'হার্ট অ্যাটাক এর লক্ষণ, কারণ ও ঝুঁকি কমানোর উপায়



            হার্ট অ্যাটাক - ঘুম কেড়ে নেওয়ার জন্য এই শব্দ দুটিই যথেষ্ট!!

            "হার্ট অ্যাটাক" হল হৃৎধমনীর রক্তপ্রবাহে অবরোধের কারণে হৃৎপিণ্ডের দেওয়ালের কোন অংশে হৃৎপেশীর রক্ত অভাবজনিত মৃত্যু (ইনফার্কসন)। অনেক সময় সাময়িক ব্যাথার পরে রক্তপ্রবাহ পুনরায় ফিরে এলে হৃৎপেশীর সম্পূর্ণ মৃত্যু না হয়ে থাকতে পারে এবং সেক্ষেত্রে তা হার্ট অ্যাট্যাক নয়, অ্যাঞ্জাইনা পেক্টোরিস বা ক্ষণস্থায়ী বক্ষযন্ত্রণা।



            ✅ হার্ট অ্যাটাকের লক্ষণঃ

            • বুকে অসহ্য চাপ, অস্বস্তি বা ব্যথা অনুভব।
            • বাহু, গলা, পিঠ, চোয়াল বা পাকস্থলির উপরের অংশ ব্যথা বা অস্বস্তি।
            • ঘন ঘন নিঃশ্বাস প্রশ্বাস।
            • বমি বমি ভাব, বমি হওয়া।
            • মাথা ঝিমঝিম করা।
            • ঠান্ডা ঘাম বেরিয়ে যাওয়া।
            • ঘুমে ব্যাঘাত ঘটা।
            • নিজেকে শক্তিহীন বা শ্রান্তবোধ করা।
            • কোন রকম শারীরিক কসরৎ ছাড়াই হঠাৎ করে ঘেমে যাওয়া।



            ✅ হার্ট অ্যাটাকের কারণঃ

            • ধূমপান
            • মদ্যপান
            • বায়ু দূষণ
            • ডায়াবিটিস
            • উচ্চ রক্তচাপ
            • অতিরিক্ত ওজন
            • অতিরিক্ত কোলেস্টেরল
            • স্বল্প শারীরিক পরিশ্রম
            • পারিবারিক ইতিহাস



            ✅ ঝুঁকি কমানোর উপায়ঃ

            • ব্লাড প্রেসার জানা এবং কন্ট্রোল করা
            • কোলেসটেরল এবং চর্বি জাতীয় খাবার না খাওয়া
            • পাতে লবণ না খাওয়া
            • ডায়াবেটিস নিয়ন্ত্রণ করা
            • নিয়ম করে হাটা
            • দুশ্চিন্তা না করা
            • ধূমপান থেকে বিরত থাকা
            • মদ্যপান না করা

            ✅ হার্ট অ্যাটাক এর লক্ষণ দেখা দিলে যত দ্রুত সম্ভব রোগীকে নিকটস্থ হাসপাতালে নিয়ে যান এবং বিশেষজ্ঞ ডাক্তারের পরামর্শ মেনে চলুন।','image'=>'/assets/news_photos/51673931859-637531.webp', 'status' => 1, 'date'=>'9 Jan, 2023'),
            array('id'=> 2, 'title'=> '	কিছু ওষুধ সেবনের নিয়ম-কানুন', 'url' => 'https://www.primehospitalltd.com/blog/5', 'description' => '✅ কিছু ওষুধ সেবনের নিয়ম-কানুন:

            ১. ব্যাথানাশক ওষুধ, যেমন: ডাইক্লোফেনাক সোডিয়াম, ন্যাপ্রোক্সেন, আইবুপ্রোফেন, অ্যাসপিরিন ও কিটোরোলাক ইত্যাদি ভরা পেটে গ্রহণ করতে হবে। অন্যথায় অন্ত্র ফুটো হয়ে যেতে পারে।

            ২. প্রোটন পাম্প ইনহিবিটর, যেমন: ওমিপ্রাজল, প্যান্টোপ্রাজল, ইসোমেপ্রাজল ইত্যাদি খাবারের আগে সেবন করতে হবে।

            ৩. ঠাণ্ডা-সর্দি বা অ্যালার্জির জন্য অ্যান্টিহিস্টামিন, যেমন: লোরাটাডিন, সেটিরিজিন, ফেক্সোফেনাডিন খালি পেটে গ্রহণ করলে এর কার্যকারিতা বেশি হয়।

            ৪. অ্যান্টাসিড খাবারের পর না খেয়ে ৩০ মিনিট পর খেলে ভালো ফল পাওয়া যায়।

            ৫. সিপ্রোফ্লক্সাসিন খাবার খাওয়ার ২ ঘণ্টা পর পর্যাপ্ত পরিমাণ পানি দিয়ে সেবন করাই ভালো। সিপ্রোফ্লক্সাসিন গ্রহণের ২ ঘণ্টার মধ্যে দুগ্ধজাত খাবার বা ক্যালসিয়াম, ম্যাগনেশিয়াম, অ্যালুমিনিয়াম, আয়রন বা জিংকযুক্ত খাবার খাওয়া উচিৎ না।

            ৬. ক্যালসিয়াম ট্যাবলেট, আয়রন ট্যাবলেট, মাল্টিভিটামিন খাবার কয়েক ঘণ্টা আগে বা পরে সেবন করতে পারেন।

            ৭. পেনিসিলিন খালি পেটে সেবন করাই ভালো।

            ৮. কিছু ওষুধ, যেমন কোট্রিম সেবন করলে বেশি পরিমাণে পানি পান করতে হবে। না হলে এটি কিডনিতে পাথর তৈরি করে সমস্যা করতে পারে।

            ৯. একসঙ্গে বেশ কয়েকটি ওষুধ সেবন করলে ওষুধের মধ্যে প্রতিক্রিয়ায় কোনো কোনো ক্ষেত্রে ওষুধের কার্যকারিতা কমতে পারে। আবার কোনো কোনো ক্ষেত্রে ওষুধের কার্যকারিতা বাড়তে পারে। এ দুটোই বেশ ক্ষতিকর। তাই এক্ষেত্রে অবশ্যই চিকিৎসকের পরামর্শ মানতে হবে।

            ১০. হাঁপানি আছে এমন ব্যক্তির ব্যথানাশক ওষুধ, বিটা ব্লকার-এটেনোলল, প্রোপানোলল সেবন করা থেকে বিরত থাকতে হবে।

            ১১. গর্ভাবস্থায় ওষুধ সেবন গর্ভধারণ ও ভ্রূণের ওপর ক্ষতিকর প্রভাব ফেলতে পারে। থ্যালিডোমাইড, রেটিনয়েড, ক্যান্সারের ওষুধ সেবন করলে গর্ভের শিশুর ক্ষতি হতে পারে। গর্ভকালীন টেট্রাসাইক্লিন শিশুর দাঁত ও হাড়ের গঠনে বাধা দেয়। গর্ভকালীন ডায়াবেটিসের ওষুধ শিশুর হাইপোগ্লাইসেমিয়া করে মারাত্মক ক্ষতি করতে পারে। তাই এ সময় ইনসুলিন নিতে হয়।

            ✅ অবশ্যই চিকিৎসকের পরামর্শ মেনে ওষুধ খাবেন।', 'image' => '/assets/news_photos/41673931947-174864.webp', 'status' => 1, 'date'=>'7 Jan, 2023'),
            array('id'=> 3, 'title'=>'স্ট্রোক - কারণ, লক্ষণ ও ঝুঁকি কমানোর উপায়', 'url'=> 'https://www.primehospitalltd.com/blog/7', 'description'=>'মস্তিষ্কের অভ্যন্তরে রক্ত সরবরাহে ব্যাঘাত ঘটার ফলে যে অব্যবস্থা জন্ম নেয় তাকে বলা হয় স্ট্রোক (Stroke)। কারণ রক্ত প্রবাহ শরীরের সব জায়গার মত ব্রেইনেও অক্সিজেন এবং প্রয়োজনীয় উপাদান বহন করে নিয়ে যায়।

            ✅ রক্ত প্রবাহ বন্ধ হয়ে যেতে পারে ২ ভাবেঃ

            ১. শিরার ভিতর জমাট বাধা রক্তের কারণে।
            ২. শিরা ফেটে গিয়ে।

            অল্প কিছুক্ষণ অক্সিজেন ছাড়া থাকলেই ব্রেইনের নার্ভের কোষগুলো মারা যাওয়া শুরু করে।
            যখন ব্রেইনের কোনো কোষ অক্সিজেনের অভাবে মারা যায়, তখন শরীরের কোন একটি অংশ তার নিয়ন্ত্রণ হারিয়ে ফেলে। কারণ মারা যাওয়া কোষগুলো শরীরের ঐ অংশের সাধারণ কার্য পরিচালনা করে। ফলে প্যারালাইসিস হয় অথবা কথা বলতে না পারা অথবা দৃষ্টি শক্তিতে সমস্যা হয়।

            ✅ ব্রেইন স্ট্রোক এর লক্ষণঃ

            ১. হঠাৎ করে শরীরের কোন অংশ অবশ কিংবা দুর্বলতা অনুভব করা।
            ২. হঠাৎ কথা বলার সময় মুখের/জিহ্বার নিয়ন্ত্রণ হারিয়ে ফেলা অথবা কারো কথা শোনার সময় না বুঝা।
            ৩. হঠাৎ করে এক অথবা দুই চোখে না দেখতে পাওয়া, কিংবা দেখতে অসুবিধা হওয়া।
            ৪. হাটার সময় অসুবিধা বোধ করা, মাথা ঝিমঝিম কিংবা শরীরের নিয়ন্ত্রণ ধরে রাখতে না পারা।
            ৫. হঠাৎ করে প্রচন্ড মাথা ব্যাথা করা।

            ✅ ব্রেইন স্ট্রোক এর ঝুঁকিপূর্ণ কারণঃ

            ১. উচ্চ রক্তচাপ
            ২. রক্তে অতিরিক্ত কোলেস্টেরল থাকলে
            ৩. হার্টের রোগ থাকলে
            ৪. ডায়াবেটিস বা বহুমূত্র রোগ
            ৫. ধুমপান
            ৬. স্থূলতা বা অতিরিক্ত ওজন
            ৭. মদ্যপান
            ৮. পারিবারিক ইতিহাস

            ✅ স্ট্রোকের ঝুঁকি কমানোর উপায়ঃ

            ১. ব্লাড প্রেসার জানা এবং কন্ট্রোল করা
            ২. ধুমপান না করা
            ৩. কোলেসটেরল এবং চর্বি জাতীয় খাবার না খাওয়া
            ৪. নিয়ম মতো খাবার খাওয়া
            ৫. ডায়াবেটিস নিয়ন্ত্রণ করা
            ৬. নিয়ম করে হাটা বা হালকা দৌড়ানো
            ৭. দুশ্চিন্তা নিয়ন্ত্রণ করা
            ৮. মাদক না নেয়া, মদ্যপান না করা

            ✅ স্ট্রোক হলে রোগীকে যত দ্রুত সম্ভব নিকটস্থ হাসপাতালে নিয়ে যান এবং বিশেষজ্ঞ ডাক্তারের পরামর্শ নিন।', 'image'=>'/assets/news_photos/31673931961-365941.webp', 'status'=>1,'date'=>'11 Jan, 2023'),
            array('id'=>4,'title'=>'দিনে আধা ঘণ্টা হাঁটা কমাবে স্ট্রোকের ঝুঁকি', 'url'=>'https://www.primehospitalltd.com/blog/4','description'=>'যেসব মানুষ দিনে অন্তত ৩৫ মিনিট হাঁটেন অথবা সপ্তাহে দুই-তিন ঘণ্টা সাঁতার কাটেন, তাদের স্ট্রোকের ঝুঁকির মাত্রা শারীরিকভাবে নিষ্ক্রিয়দের তুলনায় কম। নতুন এক গবেষণায় এ তথ্য উঠে এসেছে। এ গবেষণার জন্য অংশগ্রহণকারীদের ‘শারীরিক সক্রিয়তা’ পরীক্ষা করা হয়। যেসব মানুষের স্ট্রোক হয়েছিল, তাদের জিজ্ঞেস করা হয়েছিল স্ট্রোকের পূর্বে তাঁরা অবসর সময়ে কেমন চলাফেরা করতেন বা কত সময় ধরে ব্যায়াম করতেন।', 'image'=>'/assets/news_photos/21673931978-668524.webp', 'status'=>1,'date'=>'13 Jan, 2023'),
            array('id'=>5, 'title'=>'KIDNEY DIALYSIS UNIT', 'url'=>'https://www.primehospitalltd.com/blog/1', 'description'=> 'কিডনী(Kidney) চিকিৎসায় আমাদের রয়েছে আধুনিক যন্ত্রপাতি নিয়ে সুসজ্জিত - "প্রাইম হাসপাতাল কিডনী ডায়ালাইসিস সেন্টার"।



            ডায়ালাইসিস কী?

            ডায়ালাইসিস হচ্ছে কৃত্রিম উপায়ে যন্ত্রের সাহায্যে রক্ত পরিশোধন বা রক্ত বিশুদ্ধ করার একটি কার্যকর চিকিৎসা প্রক্রিয়া। কিডনী (kidney) সার্বক্ষণিকভাবে শরীরের অনেক গুরুত্বপূর্ণ কাজ করে আমাদের সুস্থ রাখে। তবে অনিয়ন্ত্রিত ডায়াবেটিস, উচ্চ রক্তচাপ ও কিডনী রোগীদের কিডনির কার্যকারিতা অনেকটা কমে গেলে বা তা নষ্ট হয়ে গেলে কিডনী বিশেষজ্ঞদের পরামর্শ অনুযায়ী ডায়ালাইসিসের', 'image'=>'/assets/news_photos/11673931992-648063.webp', 'status'=>1,'date'=>'10 Jan, 2023')
        );

        foreach($all_news as $item){
            ArticleandNews::firstOrCreate([
                'id'             => $item['id'],
            ],
            [
                'title'          => $item['title'],
                'url'            => $item['url'],
                'description'    => $item['description'],
                'image'          => $item['image'],
                'status'         => $item['status'],
                'date'           => $item['date'],
            ]);
        }
    }
}
